vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1024_DFP.pdsc
    <condition id='component.cs42448_adapter.condition_id'>
      <require condition='allOf.device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='component.cs42888_adapter.condition_id'>
      <require condition='allOf.device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='component.da7212_adapter.condition_id'>
      <require condition='allOf.device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='component.eeprom_AT25Fxxxx.condition_id'>
      <require condition='allOf.device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='component.eeprom_AT45DBxxxx.condition_id'>
      <require condition='allOf.device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='component.eeprom_InternalFlash.condition_id'>
      <require condition='allOf.device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='component.enable_pca9544.condition_id'>
      <require condition='allOf.component.i2c_mux_pca954x, device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='component.enable_pca9548.condition_id'>
      <require condition='allOf.component.i2c_mux_pca954x, device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='component.eth_phy_common.condition_id'>
      <require condition='allOf.driver.common, device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='allOf.driver.common, device=MIMXRT1024.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
      <require condition='device.MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='component.exception_handling_cm7.condition_id'>
      <require condition='allOf.utility.assert, utility.debug_console, device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='allOf.utility.assert, utility.debug_console, device=MIMXRT1024.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Utilities' Csub='assert'/>
      <require Cclass='Device' Cgroup='SDK Utilities' Csub='debug_console'/>
      <require condition='device.MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='component.flash_adapter.condition_id'>
      <require condition='allOf.anyOf=allOf=component.mcxw_flash_adapter, driver.romapi, device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=allOf=component.mcxw_flash_adapter, driver.romapi, device=MIMXRT1024.internal_condition'>
      <require condition='anyOf.allOf=component.mcxw_flash_adapter, driver.romapi.internal_condition'/>
      <require condition='device.MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='anyOf.allOf=component.mcxw_flash_adapter, driver.romapi.internal_condition'>
      <accept condition='allOf.component.mcxw_flash_adapter, driver.romapi.internal_condition'/>
    </condition>
    <condition id='allOf.component.mcxw_flash_adapter, driver.romapi.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='mcxw_flash_adapter'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='romapi'/>
    </condition>
    <condition id='component.flash_nand_flexspi.condition_id'>
      <require condition='allOf.driver.flexspi, device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='allOf.driver.flexspi, device=MIMXRT1024.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='flexspi'/>
      <require condition='device.MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='component.flash_nand_semc.condition_id'>
      <require condition='allOf.driver.semc, device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='allOf.driver.semc, device=MIMXRT1024.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='semc'/>
      <require condition='device.MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='component.flash_nor_flexspi.condition_id'>
      <require condition='allOf.driver.flexspi, device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='component.flash_nor_lpspi.condition_id'>
      <require condition='allOf.driver.lpspi, device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='allOf.driver.lpspi, device=MIMXRT1024.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='lpspi'/>
      <require condition='device.MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='component.gpt_adapter.condition_id'>
      <require condition='allOf.driver.gpt, device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='allOf.driver.gpt, device=MIMXRT1024.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='gpt'/>
      <require condition='device.MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='component.i2c_adapter_interface.condition_id'>
      <require condition='allOf.anyOf=allOf=anyOf=driver.lpi2c, component.lpi2c_adapter, device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=allOf=anyOf=driver.lpi2c, component.lpi2c_adapter, device=MIMXRT1024.internal_condition'>
      <require condition='anyOf.allOf=anyOf=driver.lpi2c, component.lpi2c_adapter.internal_condition'/>
      <require condition='device.MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='anyOf.allOf=anyOf=driver.lpi2c, component.lpi2c_adapter.internal_condition'>
      <accept condition='allOf.anyOf=driver.lpi2c, component.lpi2c_adapter.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=driver.lpi2c, component.lpi2c_adapter.internal_condition'>
      <require condition='anyOf.driver.lpi2c.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='lpi2c_adapter'/>
    </condition>
    <condition id='anyOf.driver.lpi2c.internal_condition'>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='i2c'/>
    </condition>
