vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1024_DFP.pdsc
    <condition id='component.phyvsc8541.condition_id'>
      <require condition='allOf.component.eth_phy_common, device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='component.phyyt8521.condition_id'>
      <require condition='allOf.component.eth_phy_common, device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='component.pit_adapter.condition_id'>
      <require condition='allOf.driver.pit, device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='allOf.driver.pit, device=MIMXRT1024.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='pit'/>
      <require condition='device.MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='component.reset_adapter.condition_id'>
      <require condition='allOf.device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='component.rng_adapter_interface.condition_id'>
      <require condition='allOf.anyOf=allOf=component.trng_adapter, driver.trng, component.software_rng_adapter, device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=allOf=component.trng_adapter, driver.trng, component.software_rng_adapter, device=MIMXRT1024.internal_condition'>
      <require condition='anyOf.allOf=component.trng_adapter, driver.trng, component.software_rng_adapter.internal_condition'/>
      <require condition='device.MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='anyOf.allOf=component.trng_adapter, driver.trng, component.software_rng_adapter.internal_condition'>
      <accept condition='allOf.component.trng_adapter, driver.trng.internal_condition'/>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='software_rng_adapter'/>
    </condition>
    <condition id='allOf.component.trng_adapter, driver.trng.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='trng_adapter'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='trng'/>
    </condition>
    <condition id='component.rnga_adapter.condition_id'>
      <require condition='allOf.device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='component.serial_manager.condition_id'>
      <require condition='allOf.anyOf=component.serial_manager_spi, component.serial_manager_swo, component.serial_manager_uart, component.serial_manager_virtual, component.lists, driver.common, device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=component.serial_manager_spi, component.serial_manager_swo, component.serial_manager_uart, component.serial_manager_virtual, component.lists, driver.common, device=MIMXRT1024.internal_condition'>
      <require condition='anyOf.component.serial_manager_spi, component.serial_manager_swo, component.serial_manager_uart, component.serial_manager_virtual.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='lists'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
      <require condition='device.MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='anyOf.component.serial_manager_spi, component.serial_manager_swo, component.serial_manager_uart, component.serial_manager_virtual.internal_condition'>
      <accept Cclass='Device' Cgroup='SDK Utilities' Csub='serial_manager_spi'/>
      <accept Cclass='Device' Cgroup='SDK Utilities' Csub='serial_manager_swo'/>
      <accept Cclass='Device' Cgroup='SDK Utilities' Csub='serial_manager_uart'/>
      <accept Cclass='Device' Cgroup='SDK Utilities' Csub='serial_manager_virtual'/>
    </condition>
    <condition id='component.serial_manager_spi.condition_id'>
      <require condition='allOf.anyOf=allOf=component.lpspi_adapter, driver.lpspi, device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=allOf=component.lpspi_adapter, driver.lpspi, device=MIMXRT1024.internal_condition'>
      <require condition='anyOf.allOf=component.lpspi_adapter, driver.lpspi.internal_condition'/>
      <require condition='device.MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='anyOf.allOf=component.lpspi_adapter, driver.lpspi.internal_condition'>
      <accept condition='allOf.component.lpspi_adapter, driver.lpspi.internal_condition'/>
    </condition>
    <condition id='allOf.component.lpspi_adapter, driver.lpspi.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='lpspi_adapter'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='lpspi'/>
    </condition>
    <condition id='component.serial_manager_swo.condition_id'>
      <require condition='allOf.device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='component.serial_manager_uart.condition_id'>
      <require condition='allOf.anyOf=driver.lpuart, device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='component.serial_manager_virtual.condition_id'>
      <require condition='allOf.device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='component.sgtl_adapter.condition_id'>
      <require condition='allOf.device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='device_id.MIMXRT1024xxxxx.internal_condition'>
      <accept Dname='MIMXRT1024CAG4A' Dvendor='NXP:11'/>
      <accept Dname='MIMXRT1024CAG4B' Dvendor='NXP:11'/>
      <accept Dname='MIMXRT1024DAG5A' Dvendor='NXP:11'/>
      <accept Dname='MIMXRT1024DAG5B' Dvendor='NXP:11'/>
    </condition>
    <condition id='component.silicon_id.condition_id'>
      <require condition='allOf.anyOf=allOf=anyOf=device_id=MIMXRT1024xxxxx, component.silicon_id_imxrt10xx, driver.common.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=allOf=anyOf=device_id=MIMXRT1024xxxxx, component.silicon_id_imxrt10xx, driver.common.internal_condition'>
      <require condition='anyOf.allOf=anyOf=device_id=MIMXRT1024xxxxx, component.silicon_id_imxrt10xx.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
    </condition>
    <condition id='anyOf.allOf=anyOf=device_id=MIMXRT1024xxxxx, component.silicon_id_imxrt10xx.internal_condition'>
      <accept condition='allOf.anyOf=device_id=MIMXRT1024xxxxx, component.silicon_id_imxrt10xx.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=device_id=MIMXRT1024xxxxx, component.silicon_id_imxrt10xx.internal_condition'>
      <require condition='anyOf.device_id=MIMXRT1024xxxxx.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='silicon_id_rt10xx'/>
    </condition>
    <condition id='anyOf.device_id=MIMXRT1024xxxxx.internal_condition'>
      <accept condition='device_id.MIMXRT1024xxxxx.internal_condition'/>
    </condition>
