vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1024_DFP.pdsc
    <condition id='component.silicon_id_imx8.condition_id'>
      <require condition='allOf.device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='component.silicon_id_imx93.condition_id'>
      <require condition='allOf.device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='component.silicon_id_imxrt10xx.condition_id'>
      <require condition='allOf.device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='component.silicon_id_imxrt1170.condition_id'>
      <require condition='allOf.device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='component.silicon_id_imxrt1180.condition_id'>
      <require condition='allOf.device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='component.silicon_id_mcxn.condition_id'>
      <require condition='allOf.device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='component.silicon_id_rw610.condition_id'>
      <require condition='allOf.device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='component.silicon_id_scfw.condition_id'>
      <require condition='allOf.device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='component.software_crc_adapter.condition_id'>
      <require condition='allOf.device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='component.software_rng_adapter.condition_id'>
      <require condition='allOf.component.rng_adapter_interface, device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='allOf.component.rng_adapter_interface, device=MIMXRT1024.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='rng_adapter_interface'/>
      <require condition='device.MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='component.tfa9896_adapter.condition_id'>
      <require condition='allOf.device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='component.tfa9xxx_adapter.condition_id'>
      <require condition='allOf.device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='component.timer_manager.condition_id'>
      <require condition='allOf.anyOf=allOf=component.gpt_adapter, driver.gpt, allOf=component.pit_adapter, driver.pit, component.lists, driver.common, device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=allOf=component.gpt_adapter, driver.gpt, allOf=component.pit_adapter, driver.pit, component.lists, driver.common, device=MIMXRT1024.internal_condition'>
      <require condition='anyOf.allOf=component.gpt_adapter, driver.gpt, allOf=component.pit_adapter, driver.pit.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='lists'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
      <require condition='device.MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='anyOf.allOf=component.gpt_adapter, driver.gpt, allOf=component.pit_adapter, driver.pit.internal_condition'>
      <accept condition='allOf.component.gpt_adapter, driver.gpt.internal_condition'/>
      <accept condition='allOf.component.pit_adapter, driver.pit.internal_condition'/>
    </condition>
    <condition id='allOf.component.gpt_adapter, driver.gpt.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='gpt_adapter'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='gpt'/>
    </condition>
    <condition id='allOf.component.pit_adapter, driver.pit.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='pit_adapter'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='pit'/>
    </condition>
    <condition id='component.trng_adapter.condition_id'>
      <require condition='allOf.component.rng_adapter_interface, driver.trng, device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='allOf.component.rng_adapter_interface, driver.trng, device=MIMXRT1024.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='rng_adapter_interface'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='trng'/>
      <require condition='device.MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='component.wifi_bt_module.88W8987.condition_id'>
      <require condition='allOf.anyOf=component.wifi_bt_module.board_aw_cm358_usd, component.wifi_bt_module.board_aw_cm358ma, component.wifi_bt_module.board_murata_1zm_m2, component.wifi_bt_module.board_murata_1zm_usd, component.wifi_bt_module.board_ubx_jody_w2_usd, component.wifi_bt_module.config, device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=component.wifi_bt_module.board_aw_cm358_usd, component.wifi_bt_module.board_aw_cm358ma, component.wifi_bt_module.board_murata_1zm_m2, component.wifi_bt_module.board_murata_1zm_usd, component.wifi_bt_module.board_ubx_jody_w2_usd, component.wifi_bt_module.config, device=MIMXRT1024.internal_condition'>
      <require condition='anyOf.component.wifi_bt_module.board_aw_cm358_usd, component.wifi_bt_module.board_aw_cm358ma, component.wifi_bt_module.board_murata_1zm_m2, component.wifi_bt_module.board_murata_1zm_usd, component.wifi_bt_module.board_ubx_jody_w2_usd.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='wifi_bt_module_config'/>
      <require condition='device.MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='anyOf.component.wifi_bt_module.board_aw_cm358_usd, component.wifi_bt_module.board_aw_cm358ma, component.wifi_bt_module.board_murata_1zm_m2, component.wifi_bt_module.board_murata_1zm_usd, component.wifi_bt_module.board_ubx_jody_w2_usd.internal_condition'>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='wifi_bt_module_aw_cm358_usd'/>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='wifi_bt_module_aw_cm358ma'/>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='wifi_bt_module_murata_1zm_m2'/>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='wifi_bt_module_murata_1zm_usd'/>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='wifi_bt_module_ubx_jody_w2_usd'/>
    </condition>
