vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1024_DFP.pdsc
    <condition id='component.wifi_bt_module.IW416.condition_id'>
      <require condition='allOf.anyOf=component.wifi_bt_module.board_aw_am457_usd, component.wifi_bt_module.board_aw_am457ma, component.wifi_bt_module.board_aw_am510_arduino, component.wifi_bt_module.board_aw_am510_usd, component.wifi_bt_module.board_aw_am510ma, component.wifi_bt_module.board_murata_1xk_m2, component.wifi_bt_module.board_murata_1xk_usd, component.wifi_bt_module.board_ubx_maya_w1_usd, component.wifi_bt_module.config, device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=component.wifi_bt_module.board_aw_am457_usd, component.wifi_bt_module.board_aw_am457ma, component.wifi_bt_module.board_aw_am510_arduino, component.wifi_bt_module.board_aw_am510_usd, component.wifi_bt_module.board_aw_am510ma, component.wifi_bt_module.board_murata_1xk_m2, component.wifi_bt_module.board_murata_1xk_usd, component.wifi_bt_module.board_ubx_maya_w1_usd, component.wifi_bt_module.config, device=MIMXRT1024.internal_condition'>
      <require condition='anyOf.component.wifi_bt_module.board_aw_am457_usd, component.wifi_bt_module.board_aw_am457ma, component.wifi_bt_module.board_aw_am510_arduino, component.wifi_bt_module.board_aw_am510_usd, component.wifi_bt_module.board_aw_am510ma, component.wifi_bt_module.board_murata_1xk_m2, component.wifi_bt_module.board_murata_1xk_usd, component.wifi_bt_module.board_ubx_maya_w1_usd.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='wifi_bt_module_config'/>
      <require condition='device.MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='anyOf.component.wifi_bt_module.board_aw_am457_usd, component.wifi_bt_module.board_aw_am457ma, component.wifi_bt_module.board_aw_am510_arduino, component.wifi_bt_module.board_aw_am510_usd, component.wifi_bt_module.board_aw_am510ma, component.wifi_bt_module.board_murata_1xk_m2, component.wifi_bt_module.board_murata_1xk_usd, component.wifi_bt_module.board_ubx_maya_w1_usd.internal_condition'>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='wifi_bt_module_aw_am457_usd'/>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='wifi_bt_module_aw_am457ma'/>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='wifi_bt_module_aw_am510_arduino'/>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='wifi_bt_module_aw_am510_usd'/>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='wifi_bt_module_aw_am510ma'/>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='wifi_bt_module_murata_1xk_m2'/>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='wifi_bt_module_murata_1xk_usd'/>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='wifi_bt_module_ubx_maya_w1_usd'/>
    </condition>
    <condition id='component.wifi_bt_module.IW61X.condition_id'>
      <require condition='allOf.anyOf=component.wifi_bt_module.board_murata_2dl_m2, component.wifi_bt_module.board_murata_2dl_usd, component.wifi_bt_module.board_murata_2el_m2, component.wifi_bt_module.board_murata_2el_usd, component.wifi_bt_module.board_murata_2ll_m2, component.wifi_bt_module.board_ubx_jody_w5_m2, component.wifi_bt_module.board_ubx_jody_w5_usd, component.wifi_bt_module.config, device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=component.wifi_bt_module.board_murata_2dl_m2, component.wifi_bt_module.board_murata_2dl_usd, component.wifi_bt_module.board_murata_2el_m2, component.wifi_bt_module.board_murata_2el_usd, component.wifi_bt_module.board_murata_2ll_m2, component.wifi_bt_module.board_ubx_jody_w5_m2, component.wifi_bt_module.board_ubx_jody_w5_usd, component.wifi_bt_module.config, device=MIMXRT1024.internal_condition'>
      <require condition='anyOf.component.wifi_bt_module.board_murata_2dl_m2, component.wifi_bt_module.board_murata_2dl_usd, component.wifi_bt_module.board_murata_2el_m2, component.wifi_bt_module.board_murata_2el_usd, component.wifi_bt_module.board_murata_2ll_m2, component.wifi_bt_module.board_ubx_jody_w5_m2, component.wifi_bt_module.board_ubx_jody_w5_usd.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='wifi_bt_module_config'/>
      <require condition='device.MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='anyOf.component.wifi_bt_module.board_murata_2dl_m2, component.wifi_bt_module.board_murata_2dl_usd, component.wifi_bt_module.board_murata_2el_m2, component.wifi_bt_module.board_murata_2el_usd, component.wifi_bt_module.board_murata_2ll_m2, component.wifi_bt_module.board_ubx_jody_w5_m2, component.wifi_bt_module.board_ubx_jody_w5_usd.internal_condition'>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='wifi_bt_module_murata_2dl_m2'/>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='wifi_bt_module_murata_2dl_usd'/>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='wifi_bt_module_murata_2el_m2'/>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='wifi_bt_module_murata_2el_usd'/>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='wifi_bt_module_murata_2ll_m2'/>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='wifi_bt_module_ubx_jody_w5_m2'/>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='wifi_bt_module_ubx_jody_w5_usd'/>
    </condition>
    <condition id='component.wifi_bt_module.RW61X.condition_id'>
      <require condition='allOf.anyOf=component.wifi_bt_module.board_frdm_rw61x, component.wifi_bt_module.board_rd_rw61x, component.wifi_bt_module.config, device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=component.wifi_bt_module.board_frdm_rw61x, component.wifi_bt_module.board_rd_rw61x, component.wifi_bt_module.config, device=MIMXRT1024.internal_condition'>
      <require condition='anyOf.component.wifi_bt_module.board_frdm_rw61x, component.wifi_bt_module.board_rd_rw61x.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='wifi_bt_module_config'/>
      <require condition='device.MIMXRT1024.internal_condition'/>
    </condition>
