vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1024_DFP.pdsc
    <condition id='component.wifi_bt_module.board_murata_2el_usd.condition_id'>
      <require condition='allOf.component.wifi_bt_module.IW61X, component.wifi_bt_module.config, device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='component.wifi_bt_module.board_murata_2ll_m2.condition_id'>
      <require condition='allOf.component.wifi_bt_module.IW61X, component.wifi_bt_module.config, device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='component.wifi_bt_module.board_rd_rw61x.condition_id'>
      <require condition='allOf.component.wifi_bt_module.RW61X, component.wifi_bt_module.config, device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='component.wifi_bt_module.board_ubx_jody_w2_usd.condition_id'>
      <require condition='allOf.component.wifi_bt_module.88W8987, component.wifi_bt_module.config, device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='component.wifi_bt_module.board_ubx_jody_w5_m2.condition_id'>
      <require condition='allOf.component.wifi_bt_module.IW61X, component.wifi_bt_module.config, device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='component.wifi_bt_module.board_ubx_jody_w5_usd.condition_id'>
      <require condition='allOf.component.wifi_bt_module.IW61X, component.wifi_bt_module.config, device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='component.wifi_bt_module.board_ubx_lily_w1_usd.condition_id'>
      <require condition='allOf.device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='component.wifi_bt_module.board_ubx_maya_w1_usd.condition_id'>
      <require condition='allOf.component.wifi_bt_module.IW416, component.wifi_bt_module.config, device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='component.wifi_bt_module.bt_only_fw.condition_id'>
      <require condition='allOf.device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='component.wifi_bt_module.config.condition_id'>
      <require condition='allOf.anyOf=component.wifi_bt_module.88W8987, component.wifi_bt_module.IW416, component.wifi_bt_module.IW61X, component.wifi_bt_module.RW61X, device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=component.wifi_bt_module.88W8987, component.wifi_bt_module.IW416, component.wifi_bt_module.IW61X, component.wifi_bt_module.RW61X, device=MIMXRT1024.internal_condition'>
      <require condition='anyOf.component.wifi_bt_module.88W8987, component.wifi_bt_module.IW416, component.wifi_bt_module.IW61X, component.wifi_bt_module.RW61X.internal_condition'/>
      <require condition='device.MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='anyOf.component.wifi_bt_module.88W8987, component.wifi_bt_module.IW416, component.wifi_bt_module.IW61X, component.wifi_bt_module.RW61X.internal_condition'>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='wifi_bt_module_88w8987'/>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='wifi_bt_module_iw416'/>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='wifi_bt_module_iw61x'/>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='wifi_bt_module_rw61x'/>
    </condition>
    <condition id='component.wifi_bt_module.tx_pwr_limits.condition_id'>
      <require condition='allOf.device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='component.wifi_bt_module.wifi_bt_combo_fw.condition_id'>
      <require condition='allOf.device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='component.wm8524_adapter.condition_id'>
      <require condition='allOf.device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='component.wm8904_adapter.condition_id'>
      <require condition='allOf.device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='component.wm8960_adapter.condition_id'>
      <require condition='allOf.device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='component.wm8962_adapter.condition_id'>
      <require condition='allOf.device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='device.CMSIS.condition_id'>
      <require condition='allOf.CMSIS_Include_core_cm, device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='allOf.CMSIS_Include_core_cm, device=MIMXRT1024.internal_condition'>
      <require Cclass='CMSIS' Cgroup='CORE'/>
      <require condition='device.MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='device.RTE.condition_id'>
      <require condition='allOf.device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='device.boot_header.condition_id'>
      <require condition='allOf.device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='device.linker.condition_id'>
      <require condition='allOf.device_id=MIMXRT1024xxxxx.internal_condition'/>
    </condition>
    <condition id='allOf.device_id=MIMXRT1024xxxxx.internal_condition'>
      <require condition='device_id.MIMXRT1024xxxxx.internal_condition'/>
    </condition>
    <condition id='device_ids.MIMXRT1024xxxxx.internal_condition'>
      <accept Dname='MIMXRT1024CAG4A' Dvendor='NXP:11'/>
      <accept Dname='MIMXRT1024CAG4B' Dvendor='NXP:11'/>
      <accept Dname='MIMXRT1024DAG5A' Dvendor='NXP:11'/>
      <accept Dname='MIMXRT1024DAG5B' Dvendor='NXP:11'/>
    </condition>
    <condition id='allOf.toolchains=mdk, device_ids=MIMXRT1024xxxxx.condition_id'>
      <require condition='toolchains.mdk.internal_condition'/>
      <require condition='device_ids.MIMXRT1024xxxxx.internal_condition'/>
    </condition>
    <condition id='toolchains.mdk.internal_condition'>
      <accept Tcompiler='ARMCC'/>
    </condition>
    <condition id='allOf.toolchains=armgcc, device_ids=MIMXRT1024xxxxx.condition_id'>
      <require condition='toolchains.armgcc.internal_condition'/>
      <require condition='device_ids.MIMXRT1024xxxxx.internal_condition'/>
    </condition>
    <condition id='toolchains.armgcc.internal_condition'>
      <accept Tcompiler='GCC'/>
    </condition>
    <condition id='allOf.toolchains=iar, device_ids=MIMXRT1024xxxxx.condition_id'>
      <require condition='toolchains.iar.internal_condition'/>
      <require condition='device_ids.MIMXRT1024xxxxx.internal_condition'/>
    </condition>
    <condition id='toolchains.iar.internal_condition'>
      <accept Tcompiler='IAR'/>
    </condition>
    <condition id='device.project_template.condition_id'>
      <require condition='allOf.device_id=MIMXRT1024xxxxx, CMSIS_Include_core_cm, device.startup, driver.clock, driver.common, driver.igpio, driver.iomuxc, driver.dcdc_1, driver.gpc_1, driver.src, driver.pmu, device.boot_header, component.lpuart_adapter, utility.debug_console_lite, utility.assert_lite, utility.str.internal_condition'/>
    </condition>
    <condition id='allOf.device_id=MIMXRT1024xxxxx, CMSIS_Include_core_cm, device.startup, driver.clock, driver.common, driver.igpio, driver.iomuxc, driver.dcdc_1, driver.gpc_1, driver.src, driver.pmu, device.boot_header, component.lpuart_adapter, utility.debug_console_lite, utility.assert_lite, utility.str.internal_condition'>
      <require condition='device_id.MIMXRT1024xxxxx.internal_condition'/>
      <require Cclass='CMSIS' Cgroup='CORE'/>
      <require Cclass='Device' Cgroup='Startup' Csub=''/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='clock'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='gpio'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='iomuxc'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='dcdc_1'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='gpc'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='src'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='pmu'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='xip_device'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='lpuart_adapter'/>
      <require Cclass='Device' Cgroup='SDK Utilities' Csub='debug_console_lite'/>
      <require Cclass='Device' Cgroup='SDK Utilities' Csub='assert_lite'/>
      <require Cclass='Device' Cgroup='SDK Utilities' Csub='str'/>
    </condition>
    <condition id='device.startup.condition_id'>
      <require condition='allOf.device.system, device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='allOf.device.system, device=MIMXRT1024.internal_condition'>
      <require Cclass='Device' Cgroup='CMSIS' Csub='MIMXRT1024_system'/>
      <require condition='device.MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='allOf.toolchains=iar.condition_id'>
      <require condition='toolchains.iar.internal_condition'/>
    </condition>
    <condition id='allOf.toolchains=armgcc.condition_id'>
      <require condition='toolchains.armgcc.internal_condition'/>
    </condition>
    <condition id='allOf.toolchains=mdk.condition_id'>
      <require condition='toolchains.mdk.internal_condition'/>
    </condition>
    <condition id='device.system.condition_id'>
      <require condition='allOf.device.CMSIS, device=MIMXRT1024.internal_condition'/>
    </condition>
