vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1024_DFP.pdsc
    <condition id='allOf.device.CMSIS, device=MIMXRT1024.internal_condition'>
      <require Cclass='Device' Cgroup='CMSIS' Csub='MIMXRT1024_header'/>
      <require condition='device.MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='driver.adc_12b1msps_sar.condition_id'>
      <require condition='allOf.driver.common, device_id=MIMXRT1024xxxxx.internal_condition'/>
    </condition>
    <condition id='allOf.driver.common, device_id=MIMXRT1024xxxxx.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
      <require condition='device_id.MIMXRT1024xxxxx.internal_condition'/>
    </condition>
    <condition id='driver.adc_etc.condition_id'>
      <require condition='allOf.driver.common, device_id=MIMXRT1024xxxxx.internal_condition'/>
    </condition>
    <condition id='driver.aipstz.condition_id'>
      <require condition='allOf.driver.common, device_id=MIMXRT1024xxxxx.internal_condition'/>
    </condition>
    <condition id='driver.ak4497.condition_id'>
      <require condition='allOf.component.ak4497_adapter, component.codec_adapters, component.codec_i2c, driver.codec, device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='allOf.component.ak4497_adapter, component.codec_adapters, component.codec_i2c, driver.codec, device=MIMXRT1024.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='ak4497_adapter'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='codec_adapters'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='codec_i2c'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='codec'/>
      <require condition='device.MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='driver.aoi.condition_id'>
      <require condition='allOf.driver.common, device_id=MIMXRT1024xxxxx.internal_condition'/>
    </condition>
    <condition id='driver.bee.condition_id'>
      <require condition='allOf.driver.common, device_id=MIMXRT1024xxxxx.internal_condition'/>
    </condition>
    <condition id='driver.cache_armv7_m7.condition_id'>
      <require condition='allOf.driver.common, device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='driver.camera-common.condition_id'>
      <require condition='allOf.driver.video-common, device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='allOf.driver.video-common, device=MIMXRT1024.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='video-common'/>
      <require condition='device.MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='driver.camera-device-ap1302.condition_id'>
      <require condition='allOf.driver.camera-device-common, driver.video-i2c, device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='allOf.driver.camera-device-common, driver.video-i2c, device=MIMXRT1024.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='camera-device-common'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='video-i2c'/>
      <require condition='device.MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='driver.camera-device-common.condition_id'>
      <require condition='allOf.driver.camera-common, device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='allOf.driver.camera-common, device=MIMXRT1024.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='camera-common'/>
      <require condition='device.MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='driver.camera-device-max9286.condition_id'>
      <require condition='allOf.driver.camera-device-common, driver.video-i2c, device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='driver.camera-device-mt9m114.condition_id'>
      <require condition='allOf.driver.camera-device-common, driver.video-i2c, device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='driver.camera-device-ov5640.condition_id'>
      <require condition='allOf.driver.camera-device-common, driver.camera-device-sccb, device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='allOf.driver.camera-device-common, driver.camera-device-sccb, device=MIMXRT1024.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='camera-device-common'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='camera-device-sccb'/>
      <require condition='device.MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='driver.camera-device-ov7670.condition_id'>
      <require condition='allOf.driver.camera-device-common, driver.camera-device-sccb, device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='driver.camera-device-ov7725.condition_id'>
      <require condition='allOf.driver.camera-device-common, driver.camera-device-sccb, device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='driver.camera-device-sccb.condition_id'>
      <require condition='allOf.anyOf=driver.lpi2c, driver.common, device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=driver.lpi2c, driver.common, device=MIMXRT1024.internal_condition'>
      <require condition='anyOf.driver.lpi2c.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
      <require condition='device.MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='driver.camera-receiver-common.condition_id'>
      <require condition='allOf.driver.camera-common, device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='driver.clock.condition_id'>
      <require condition='allOf.device=MIMXRT1024.internal_condition'/>
    </condition>
    <condition id='driver.cmp.condition_id'>
      <require condition='allOf.driver.common, device_id=MIMXRT1024xxxxx.internal_condition'/>
    </condition>
    <condition id='driver.cmsis_enet.condition_id'>
      <require condition='allOf.CMSIS_Driver_Include.Ethernet, CMSIS_Driver_Include.Ethernet_MAC, CMSIS_Driver_Include.Ethernet_PHY, component.eth_phy_common, device.RTE, driver.enet, device_id=MIMXRT1024xxxxx.internal_condition'/>
    </condition>
    <condition id='allOf.CMSIS_Driver_Include.Ethernet, CMSIS_Driver_Include.Ethernet_MAC, CMSIS_Driver_Include.Ethernet_PHY, component.eth_phy_common, device.RTE, driver.enet, device_id=MIMXRT1024xxxxx.internal_condition'>
      <require Cclass='CMSIS Driver' Cgroup='Ethernet' Capiversion='2.2.0'/>
      <require Cclass='CMSIS Driver' Cgroup='Ethernet MAC' Capiversion='2.2.0'/>
      <require Cclass='CMSIS Driver' Cgroup='Ethernet PHY' Capiversion='2.2.0'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='phy-common'/>
      <require Cclass='Device' Cgroup='SDK Project Template' Csub='RTE_Device'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='enet'/>
      <require condition='device_id.MIMXRT1024xxxxx.internal_condition'/>
    </condition>
    <condition id='driver.cmsis_lpi2c.condition_id'>
      <require condition='allOf.CMSIS_Driver_Include.I2C, anyOf=allOf=driver.lpi2c, device_id=MIMXRT1024xxxxx, device.RTE, device_id=MIMXRT1024xxxxx.internal_condition'/>
    </condition>
    <condition id='allOf.CMSIS_Driver_Include.I2C, anyOf=allOf=driver.lpi2c, device_id=MIMXRT1024xxxxx, device.RTE, device_id=MIMXRT1024xxxxx.internal_condition'>
      <require Cclass='CMSIS Driver' Cgroup='I2C' Capiversion='2.4.0'/>
      <require condition='anyOf.allOf=driver.lpi2c, device_id=MIMXRT1024xxxxx.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Project Template' Csub='RTE_Device'/>
      <require condition='device_id.MIMXRT1024xxxxx.internal_condition'/>
    </condition>
    <condition id='anyOf.allOf=driver.lpi2c, device_id=MIMXRT1024xxxxx.internal_condition'>
      <accept condition='allOf.driver.lpi2c, device_id=MIMXRT1024xxxxx.internal_condition'/>
    </condition>
    <condition id='allOf.driver.lpi2c, device_id=MIMXRT1024xxxxx.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='i2c'/>
      <require condition='device_id.MIMXRT1024xxxxx.internal_condition'/>
    </condition>
    <condition id='driver.cmsis_lpspi.condition_id'>
      <require condition='allOf.CMSIS_Driver_Include.SPI, anyOf=allOf=driver.lpspi, device_id=MIMXRT1024xxxxx, device.RTE, device_id=MIMXRT1024xxxxx.internal_condition'/>
    </condition>
    <condition id='allOf.CMSIS_Driver_Include.SPI, anyOf=allOf=driver.lpspi, device_id=MIMXRT1024xxxxx, device.RTE, device_id=MIMXRT1024xxxxx.internal_condition'>
      <require Cclass='CMSIS Driver' Cgroup='SPI' Capiversion='2.3.0'/>
      <require condition='anyOf.allOf=driver.lpspi, device_id=MIMXRT1024xxxxx.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Project Template' Csub='RTE_Device'/>
      <require condition='device_id.MIMXRT1024xxxxx.internal_condition'/>
    </condition>
