vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1024_DFP.pdsc
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='enable_pca9544' Cversion='1.0.0' condition='component.enable_pca9544.condition_id'>
      <description>Component enable_pca9544</description>
      <RTE_Components_h>
#ifndef MCUX_ENABLE_PCA9544
#define MCUX_ENABLE_PCA9544 
#endif
</RTE_Components_h>
      <files>
        <file category='doc' name='components/i2c/muxes/component.enable_pca9544_dummy.txt'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='enable_pca9548' Cversion='1.0.0' condition='component.enable_pca9548.condition_id'>
      <description>Component enable_pca9548</description>
      <RTE_Components_h>
#ifndef MCUX_ENABLE_PCA9548
#define MCUX_ENABLE_PCA9548 
#endif
</RTE_Components_h>
      <files>
        <file category='doc' name='components/i2c/muxes/component.enable_pca9548_dummy.txt'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='phy-common' Cversion='2.0.0' condition='component.eth_phy_common.condition_id'>
      <description>Driver phy-common</description>
      <files>
        <file category='header' name='components/phy/fsl_phy.h' projectpath='component/phy'/>
        <file category='include' name='components/phy/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='exception_handling_cm7' Cversion='1.0.0' condition='component.exception_handling_cm7.condition_id'>
      <description>Component exception_handling_cm7</description>
      <files>
        <file category='header' name='components/exception_handling/fsl_component_exception_handling.h' projectpath='component/exception_handling'/>
        <file category='sourceC' name='components/exception_handling/cm7/fsl_component_exception_handling.c' projectpath='component/exception_handling/cm7'/>
        <file category='include' name='components/exception_handling/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='flash_adapter' Cversion='1.0.0' condition='component.flash_adapter.condition_id'>
      <description>Component flash_adapter</description>
      <files>
        <file category='doc' name='components/internal_flash/component.flash_adapter_dummy.txt'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='flash_nand_flexspi' Cversion='1.0.0' condition='component.flash_nand_flexspi.condition_id'>
      <description>Component.flash_nand_flexspi</description>
      <files>
        <file category='header' name='components/flash/nand/fsl_nand_flash.h' projectpath='nand_flash/nand'/>
        <file category='sourceC' name='components/flash/nand/flexspi/fsl_flexspi_nand_flash.c' projectpath='nand_flash/nand/flexspi'/>
        <file category='header' name='components/flash/nand/flexspi/fsl_flexspi_nand_flash.h' projectpath='nand_flash/nand/flexspi'/>
        <file category='include' name='components/flash/nand/'/>
        <file category='include' name='components/flash/nand/flexspi/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='flash_nand_semc' Cversion='1.0.0' condition='component.flash_nand_semc.condition_id'>
      <description>Component flash_nand_semc</description>
      <files>
        <file category='header' name='components/flash/nand/fsl_nand_flash.h' projectpath='nand_flash/nand'/>
        <file category='sourceC' name='components/flash/nand/semc/fsl_semc_nand_flash.c' projectpath='nand_flash/nand/semc'/>
        <file category='header' name='components/flash/nand/semc/fsl_semc_nand_flash.h' projectpath='nand_flash/nand/semc'/>
        <file category='include' name='components/flash/nand/'/>
        <file category='include' name='components/flash/nand/semc/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='flash_nor_flexspi' Cversion='1.0.0' condition='component.flash_nor_flexspi.condition_id'>
      <description>Component flash_nor_flexspi</description>
      <files>
        <file category='header' name='components/flash/nor/fsl_nor_flash.h' projectpath='nor_flash/nor'/>
        <file category='sourceC' name='components/flash/nor/flexspi/fsl_flexspi_nor_flash.c' projectpath='nor_flash/nor/flexspi'/>
        <file category='header' name='components/flash/nor/flexspi/fsl_flexspi_nor_flash.h' projectpath='nor_flash/nor/flexspi'/>
        <file category='include' name='components/flash/nor/'/>
        <file category='include' name='components/flash/nor/flexspi/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='flash_nor_lpspi' Cversion='1.0.0' condition='component.flash_nor_lpspi.condition_id'>
      <description>Component flash_nor_lpspi</description>
      <files>
        <file category='header' name='components/flash/nor/fsl_nor_flash.h' projectpath='nor_flash/nor'/>
        <file category='sourceC' name='components/flash/nor/lpspi/fsl_lpspi_nor_flash.c' projectpath='nor_flash/nor/lpspi'/>
        <file category='header' name='components/flash/nor/lpspi/fsl_lpspi_nor_flash.h' projectpath='nor_flash/nor/lpspi'/>
        <file category='sourceC' name='components/flash/nor/lpspi/fsl_lpspi_mem_adapter.c' projectpath='nor_flash/nor/lpspi'/>
        <file category='header' name='components/flash/nor/lpspi/fsl_lpspi_mem_adapter.h' projectpath='nor_flash/nor/lpspi'/>
        <file category='include' name='components/flash/nor/'/>
        <file category='include' name='components/flash/nor/lpspi/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='gpt_adapter' Cversion='1.0.0' condition='component.gpt_adapter.condition_id'>
      <description>Component gpt_adapter</description>
      <RTE_Components_h>
#ifndef TIMER_PORT_TYPE_GPT
#define TIMER_PORT_TYPE_GPT 1
#endif
</RTE_Components_h>
      <files>
        <file category='header' name='components/timer/fsl_adapter_timer.h' projectpath='component/timer'/>
        <file category='sourceC' name='components/timer/fsl_adapter_gpt.c' projectpath='component/timer'/>
        <file category='include' name='components/timer/'/>
      </files>
    </component>
