vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1024_DFP.pdsc
    <component Cclass='Device' Cgroup='CMSIS' Csub='MIMXRT1024_header' Cversion='1.0.0' condition='device.CMSIS.condition_id'>
      <description>Device MIMXRT1024_cmsis</description>
      <files>
        <file category='header' name='devices/MIMXRT1024/fsl_device_registers.h' projectpath='device'/>
        <file category='header' name='devices/MIMXRT1024/MIMXRT1024.h' projectpath='device'/>
        <file category='header' name='devices/MIMXRT1024/MIMXRT1024_features.h' projectpath='device'/>
        <file category='header' name='devices/MIMXRT1024/MIMXRT1024_COMMON.h' projectpath='device'/>
        <file category='header' name='devices/MIMXRT1024/periph/PERI_ADC.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1024/periph/PERI_ADC_ETC.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1024/periph/PERI_AIPSTZ.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1024/periph/PERI_AOI.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1024/periph/PERI_BEE.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1024/periph/PERI_CAN.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1024/periph/PERI_CCM.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1024/periph/PERI_CCM_ANALOG.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1024/periph/PERI_CM7_MCM.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1024/periph/PERI_CMP.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1024/periph/PERI_CSU.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1024/periph/PERI_DCDC.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1024/periph/PERI_DCP.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1024/periph/PERI_DMA.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1024/periph/PERI_DMAMUX.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1024/periph/PERI_ENC.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1024/periph/PERI_ENET.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1024/periph/PERI_EWM.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1024/periph/PERI_FLEXIO.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1024/periph/PERI_FLEXRAM.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1024/periph/PERI_FLEXSPI.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1024/periph/PERI_GPC.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1024/periph/PERI_GPIO.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1024/periph/PERI_GPT.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1024/periph/PERI_I2S.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1024/periph/PERI_IOMUXC.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1024/periph/PERI_IOMUXC_GPR.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1024/periph/PERI_IOMUXC_SNVS.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1024/periph/PERI_IOMUXC_SNVS_GPR.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1024/periph/PERI_KPP.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1024/periph/PERI_LPI2C.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1024/periph/PERI_LPSPI.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1024/periph/PERI_LPUART.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1024/periph/PERI_OCOTP.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1024/periph/PERI_PGC.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1024/periph/PERI_PIT.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1024/periph/PERI_PMU.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1024/periph/PERI_PWM.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1024/periph/PERI_RTWDOG.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1024/periph/PERI_SEMC.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1024/periph/PERI_SNVS.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1024/periph/PERI_SPDIF.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1024/periph/PERI_SRC.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1024/periph/PERI_TEMPMON.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1024/periph/PERI_TMR.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1024/periph/PERI_TRNG.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1024/periph/PERI_USB.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1024/periph/PERI_USBNC.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1024/periph/PERI_USBPHY.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1024/periph/PERI_USB_ANALOG.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1024/periph/PERI_USDHC.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1024/periph/PERI_WDOG.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1024/periph/PERI_XBARA.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1024/periph/PERI_XBARB.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1024/periph/PERI_XTALOSC24M.h' projectpath='device/periph'/>
        <file category='include' name='devices/MIMXRT1024/'/>
        <file category='include' name='devices/MIMXRT1024/periph/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Project Template' Csub='RTE_Device' Cversion='1.0.0' condition='device.RTE.condition_id'>
      <description>Rte_device</description>
      <files>
        <file category='header' attr='config' name='devices/MIMXRT1024/template/RTE_Device.h' version='1.0.0' projectpath='board'/>
        <file category='include' name='devices/MIMXRT1024/template/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='xip_device' Cversion='1.0.0' condition='device.boot_header.condition_id'>
      <description>Device Boot Header</description>
      <files>
        <file category='sourceC' name='devices/MIMXRT1024/xip/fsl_flexspi_nor_boot.c' projectpath='xip'/>
        <file category='header' name='devices/MIMXRT1024/xip/fsl_flexspi_nor_boot.h' projectpath='xip'/>
        <file category='include' name='devices/MIMXRT1024/xip/'/>
      </files>
    </component>
