vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1024_DFP.pdsc
    <component Cclass='Device' Cgroup='SDK Utilities' Csub='MIMXRT1024_linker' Cversion='1.0.0' condition='device.linker.condition_id'>
      <description>Device MIMXRT1024_linker</description>
      <files>
        <file condition='allOf.toolchains=mdk, device_ids=MIMXRT1024xxxxx.condition_id' category='linkerScript' attr='config' name='devices/MIMXRT1024/arm/MIMXRT1024xxxxx_flexspi_nor.scf' version='1.0.0' projectpath='MIMXRT1024/arm'/>
        <file condition='allOf.toolchains=mdk, device_ids=MIMXRT1024xxxxx.condition_id' category='linkerScript' attr='config' name='devices/MIMXRT1024/arm/MIMXRT1024xxxxx_flexspi_nor_sdram.scf' version='1.0.0' projectpath='MIMXRT1024/arm'/>
        <file condition='allOf.toolchains=mdk, device_ids=MIMXRT1024xxxxx.condition_id' category='linkerScript' attr='config' name='devices/MIMXRT1024/arm/MIMXRT1024xxxxx_ram.scf' version='1.0.0' projectpath='MIMXRT1024/arm'/>
        <file condition='allOf.toolchains=mdk, device_ids=MIMXRT1024xxxxx.condition_id' category='linkerScript' attr='config' name='devices/MIMXRT1024/arm/MIMXRT1024xxxxx_sdram.scf' version='1.0.0' projectpath='MIMXRT1024/arm'/>
        <file condition='allOf.toolchains=mdk, device_ids=MIMXRT1024xxxxx.condition_id' category='linkerScript' attr='config' name='devices/MIMXRT1024/arm/MIMXRT1024xxxxx_sdram_txt.scf' version='1.0.0' projectpath='MIMXRT1024/arm'/>
        <file condition='allOf.toolchains=armgcc, device_ids=MIMXRT1024xxxxx.condition_id' category='linkerScript' attr='config' name='devices/MIMXRT1024/gcc/MIMXRT1024xxxxx_flexspi_nor.ld' version='1.0.0' projectpath='MIMXRT1024/gcc'/>
        <file condition='allOf.toolchains=armgcc, device_ids=MIMXRT1024xxxxx.condition_id' category='linkerScript' attr='config' name='devices/MIMXRT1024/gcc/MIMXRT1024xxxxx_flexspi_nor_sdram.ld' version='1.0.0' projectpath='MIMXRT1024/gcc'/>
        <file condition='allOf.toolchains=armgcc, device_ids=MIMXRT1024xxxxx.condition_id' category='linkerScript' attr='config' name='devices/MIMXRT1024/gcc/MIMXRT1024xxxxx_ram.ld' version='1.0.0' projectpath='MIMXRT1024/gcc'/>
        <file condition='allOf.toolchains=armgcc, device_ids=MIMXRT1024xxxxx.condition_id' category='linkerScript' attr='config' name='devices/MIMXRT1024/gcc/MIMXRT1024xxxxx_sdram.ld' version='1.0.0' projectpath='MIMXRT1024/gcc'/>
        <file condition='allOf.toolchains=armgcc, device_ids=MIMXRT1024xxxxx.condition_id' category='linkerScript' attr='config' name='devices/MIMXRT1024/gcc/MIMXRT1024xxxxx_sdram_txt.ld' version='1.0.0' projectpath='MIMXRT1024/gcc'/>
        <file condition='allOf.toolchains=iar, device_ids=MIMXRT1024xxxxx.condition_id' category='linkerScript' attr='config' name='devices/MIMXRT1024/iar/MIMXRT1024xxxxx_flexspi_nor.icf' version='1.0.0' projectpath='MIMXRT1024/iar'/>
        <file condition='allOf.toolchains=iar, device_ids=MIMXRT1024xxxxx.condition_id' category='linkerScript' attr='config' name='devices/MIMXRT1024/iar/MIMXRT1024xxxxx_flexspi_nor_sdram.icf' version='1.0.0' projectpath='MIMXRT1024/iar'/>
        <file condition='allOf.toolchains=iar, device_ids=MIMXRT1024xxxxx.condition_id' category='linkerScript' attr='config' name='devices/MIMXRT1024/iar/MIMXRT1024xxxxx_ram.icf' version='1.0.0' projectpath='MIMXRT1024/iar'/>
        <file condition='allOf.toolchains=iar, device_ids=MIMXRT1024xxxxx.condition_id' category='linkerScript' attr='config' name='devices/MIMXRT1024/iar/MIMXRT1024xxxxx_sdram.icf' version='1.0.0' projectpath='MIMXRT1024/iar'/>
        <file condition='allOf.toolchains=iar, device_ids=MIMXRT1024xxxxx.condition_id' category='linkerScript' attr='config' name='devices/MIMXRT1024/iar/MIMXRT1024xxxxx_sdram_txt.icf' version='1.0.0' projectpath='MIMXRT1024/iar'/>
      </files>
    </component>
    <component Cclass='Board Support' Cgroup='SDK Project Template' Csub='project_template' Cvariant='MIMXRT1024' Cversion='1.0.0' condition='device.project_template.condition_id' isDefaultVariant='1'>
      <description>Devices_project_template MIMXRT1024</description>
      <files>
        <file category='header' attr='config' name='devices/MIMXRT1024/project_template/board.h' version='1.0.0' projectpath='board'/>
        <file category='sourceC' attr='config' name='devices/MIMXRT1024/project_template/board.c' version='1.0.0' projectpath='board'/>
        <file category='header' attr='config' name='devices/MIMXRT1024/project_template/clock_config.h' version='1.0.0' projectpath='board'/>
        <file category='sourceC' attr='config' name='devices/MIMXRT1024/project_template/clock_config.c' version='1.0.0' projectpath='board'/>
        <file category='header' attr='config' name='devices/MIMXRT1024/project_template/pin_mux.h' version='1.0.0' projectpath='board'/>
        <file category='sourceC' attr='config' name='devices/MIMXRT1024/project_template/pin_mux.c' version='1.0.0' projectpath='board'/>
        <file category='header' attr='config' name='devices/MIMXRT1024/project_template/peripherals.h' version='1.0.0' projectpath='board'/>
        <file category='sourceC' attr='config' name='devices/MIMXRT1024/project_template/peripherals.c' version='1.0.0' projectpath='board'/>
        <file category='include' name='devices/MIMXRT1024/project_template/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='Startup' Csub='' Cversion='1.0.0' condition='device.startup.condition_id'>
      <description>Device MIMXRT1024_startup</description>
      <files>
        <file condition='allOf.toolchains=iar.condition_id' category='sourceAsm' attr='config' name='devices/MIMXRT1024/iar/startup_MIMXRT1024.s' version='1.0.0' projectpath='startup/iar'/>
        <file condition='allOf.toolchains=armgcc.condition_id' category='sourceAsm' attr='config' name='devices/MIMXRT1024/gcc/startup_MIMXRT1024.S' version='1.0.0' projectpath='startup/gcc'/>
        <file condition='allOf.toolchains=mdk.condition_id' category='sourceAsm' attr='config' name='devices/MIMXRT1024/arm/startup_MIMXRT1024.S' version='1.0.0' projectpath='startup/arm'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='CMSIS' Csub='MIMXRT1024_system' Cversion='1.0.0' condition='device.system.condition_id'>
      <description>Device MIMXRT1024_system</description>
      <files>
        <file category='sourceC' name='devices/MIMXRT1024/system_MIMXRT1024.c' projectpath='device'/>
        <file category='header' name='devices/MIMXRT1024/system_MIMXRT1024.h' projectpath='device'/>
        <file category='include' name='devices/MIMXRT1024/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='adc_12b1msps_sar' Cversion='2.0.4' condition='driver.adc_12b1msps_sar.condition_id'>
      <description>ADC Driver</description>
      <files>
        <file category='sourceC' name='devices/MIMXRT1024/drivers/fsl_adc.c' projectpath='drivers'/>
        <file category='header' name='devices/MIMXRT1024/drivers/fsl_adc.h' projectpath='drivers'/>
        <file category='include' name='devices/MIMXRT1024/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='adc_etc' Cversion='2.3.2' condition='driver.adc_etc.condition_id'>
      <description>ADC_ETC Driver</description>
      <files>
        <file category='sourceC' name='devices/MIMXRT1024/drivers/fsl_adc_etc.c' projectpath='drivers'/>
        <file category='header' name='devices/MIMXRT1024/drivers/fsl_adc_etc.h' projectpath='drivers'/>
        <file category='include' name='devices/MIMXRT1024/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='aipstz' Cversion='2.0.1' condition='driver.aipstz.condition_id'>
      <description>aipstz Driver</description>
      <files>
        <file category='sourceC' name='devices/MIMXRT1024/drivers/fsl_aipstz.c' projectpath='drivers'/>
        <file category='header' name='devices/MIMXRT1024/drivers/fsl_aipstz.h' projectpath='drivers'/>
        <file category='include' name='devices/MIMXRT1024/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='ak4497' Cversion='2.1.2' condition='driver.ak4497.condition_id'>
      <description>Driver ak4497</description>
      <RTE_Components_h>
#ifndef CODEC_AK4497_ENABLE
#define CODEC_AK4497_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category='header' name='components/codec/ak4497/fsl_ak4497.h' projectpath='codec'/>
        <file category='sourceC' name='components/codec/ak4497/fsl_ak4497.c' projectpath='codec'/>
        <file category='include' name='components/codec/ak4497/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='aoi' Cversion='2.0.2' condition='driver.aoi.condition_id'>
      <description>AOI Driver</description>
      <files>
        <file category='header' name='devices/MIMXRT1024/drivers/fsl_aoi.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MIMXRT1024/drivers/fsl_aoi.c' projectpath='drivers'/>
        <file category='include' name='devices/MIMXRT1024/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='bee' Cversion='2.0.2' condition='driver.bee.condition_id'>
      <description>BEE Driver</description>
      <files>
        <file category='sourceC' name='devices/MIMXRT1024/drivers/fsl_bee.c' projectpath='drivers'/>
        <file category='header' name='devices/MIMXRT1024/drivers/fsl_bee.h' projectpath='drivers'/>
        <file category='include' name='devices/MIMXRT1024/drivers/'/>
      </files>
    </component>
