vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1024_DFP.pdsc
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='clock' Cversion='2.5.3' condition='driver.clock.condition_id'>
      <description>Clock Driver</description>
      <files>
        <file category='header' name='devices/MIMXRT1024/drivers/fsl_clock.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MIMXRT1024/drivers/fsl_clock.c' projectpath='drivers'/>
        <file category='include' name='devices/MIMXRT1024/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='cmp' Cversion='2.0.3' condition='driver.cmp.condition_id'>
      <description>CMP Driver</description>
      <files>
        <file category='sourceC' name='devices/MIMXRT1024/drivers/fsl_cmp.c' projectpath='drivers'/>
        <file category='header' name='devices/MIMXRT1024/drivers/fsl_cmp.h' projectpath='drivers'/>
        <file category='include' name='devices/MIMXRT1024/drivers/'/>
      </files>
    </component>
    <component Cclass='CMSIS Driver' Cgroup='Ethernet' Csub='enet_cmsis' Cversion='2.4.0' Capiversion='2.4.0' condition='driver.cmsis_enet.condition_id'>
      <description>ENET CMSIS Driver</description>
      <files>
        <file category='header' name='devices/MIMXRT1024/cmsis_drivers/fsl_enet_cmsis.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MIMXRT1024/cmsis_drivers/fsl_enet_cmsis.c' projectpath='drivers'/>
        <file category='sourceC' name='devices/MIMXRT1024/cmsis_drivers/fsl_enet_phy_cmsis.c' projectpath='drivers'/>
        <file category='header' name='devices/MIMXRT1024/cmsis_drivers/fsl_enet_phy_cmsis.h' projectpath='drivers'/>
        <file category='include' name='devices/MIMXRT1024/cmsis_drivers/'/>
      </files>
    </component>
    <component Cclass='CMSIS Driver' Cgroup='I2C' Csub='lpi2c_cmsis' Cversion='2.6.0' Capiversion='2.3.0' condition='driver.cmsis_lpi2c.condition_id'>
      <description>LPI2C CMSIS Driver</description>
      <files>
        <file category='header' name='devices/MIMXRT1024/cmsis_drivers/fsl_lpi2c_cmsis.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MIMXRT1024/cmsis_drivers/fsl_lpi2c_cmsis.c' projectpath='drivers'/>
        <file category='include' name='devices/MIMXRT1024/cmsis_drivers/'/>
      </files>
    </component>
    <component Cclass='CMSIS Driver' Cgroup='SPI' Csub='lpspi_cmsis' Cversion='2.12.0' Capiversion='2.2.0' condition='driver.cmsis_lpspi.condition_id'>
      <description>LPSPI CMSIS Driver</description>
      <files>
        <file category='header' name='devices/MIMXRT1024/cmsis_drivers/fsl_lpspi_cmsis.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MIMXRT1024/cmsis_drivers/fsl_lpspi_cmsis.c' projectpath='drivers'/>
        <file category='include' name='devices/MIMXRT1024/cmsis_drivers/'/>
      </files>
    </component>
    <component Cclass='CMSIS Driver' Cgroup='USART' Csub='lpuart_cmsis' Cversion='2.7.0' Capiversion='2.3.0' condition='driver.cmsis_lpuart.condition_id'>
      <description>LPUART CMSIS Driver</description>
      <files>
        <file category='header' name='devices/MIMXRT1024/cmsis_drivers/fsl_lpuart_cmsis.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MIMXRT1024/cmsis_drivers/fsl_lpuart_cmsis.c' projectpath='drivers'/>
        <file category='include' name='devices/MIMXRT1024/cmsis_drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='codec' Cversion='2.3.1' condition='driver.codec.condition_id'>
      <description>Driver codec</description>
      <RTE_Components_h>
        #ifndef SDK_I2C_BASED_COMPONENT_USED
        #define SDK_I2C_BASED_COMPONENT_USED 1
        #endif
      </RTE_Components_h>
      <files>
        <file category='header' name='components/codec/fsl_codec_common.h' projectpath='codec'/>
        <file category='sourceC' name='components/codec/fsl_codec_common.c' projectpath='codec'/>
        <file category='include' name='components/codec/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='common' Cversion='2.6.0' condition='driver.common.condition_id'>
      <description>common Driver</description>
      <files>
        <file category='header' name='devices/MIMXRT1024/drivers/fsl_common.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MIMXRT1024/drivers/fsl_common.c' projectpath='drivers'/>
        <file condition='allOf.cores=cm7f.condition_id' category='sourceC' name='devices/MIMXRT1024/drivers/fsl_common_arm.c' projectpath='drivers'/>
        <file condition='allOf.cores=cm7f.condition_id' category='header' name='devices/MIMXRT1024/drivers/fsl_common_arm.h' projectpath='drivers'/>
        <file category='include' name='devices/MIMXRT1024/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='cs42448' Cversion='2.0.1' condition='driver.cs42448.condition_id'>
      <description>Driver cs42448</description>
      <RTE_Components_h>
#ifndef CODEC_CS42448_ENABLE
#define CODEC_CS42448_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category='header' name='components/codec/cs42448/fsl_cs42448.h' projectpath='codec'/>
        <file category='sourceC' name='components/codec/cs42448/fsl_cs42448.c' projectpath='codec'/>
        <file category='include' name='components/codec/cs42448/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='cs42888' Cversion='2.1.3' condition='driver.cs42888.condition_id'>
      <description>Driver cs42888</description>
      <RTE_Components_h>
#ifndef CODEC_CS42888_ENABLE
#define CODEC_CS42888_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category='header' name='components/codec/cs42888/fsl_cs42888.h' projectpath='codec'/>
        <file category='sourceC' name='components/codec/cs42888/fsl_cs42888.c' projectpath='codec'/>
        <file category='include' name='components/codec/cs42888/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='dbi' Cversion='1.0.0' condition='driver.dbi.condition_id'>
      <description>Driver dbi</description>
      <files>
        <file category='header' name='components/video/display/dbi/fsl_dbi.h' projectpath='video'/>
        <file category='sourceC' name='components/video/display/dbi/fsl_dbi.c' projectpath='video'/>
        <file category='include' name='components/video/display/dbi/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='dc-fb-common' Cversion='1.0.0' condition='driver.dc-fb-common.condition_id'>
      <description>Driver dc-fb-common</description>
      <files>
        <file category='header' name='components/video/display/dc/fsl_dc_fb.h' projectpath='video'/>
        <file category='include' name='components/video/display/dc/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='dc-fb-dbi' Cversion='1.0.0' condition='driver.dc-fb-dbi.condition_id'>
      <description>Driver dc-fb-dbi</description>
      <RTE_Components_h>
#ifndef MCUX_DBI_LEGACY
#define MCUX_DBI_LEGACY 0
#endif
</RTE_Components_h>
      <files>
        <file category='header' name='components/video/display/dc/dbi/fsl_dc_fb_dbi.h' projectpath='video'/>
        <file category='sourceC' name='components/video/display/dc/dbi/fsl_dc_fb_dbi.c' projectpath='video'/>
        <file category='include' name='components/video/display/dc/dbi/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='dc-fb-ssd1963' Cversion='1.0.2' condition='driver.dc-fb-ssd1963.condition_id'>
      <description>Driver dc-fb-ssd1963</description>
      <files>
        <file category='header' name='components/video/display/dc/ssd1963/fsl_dc_fb_ssd1963.h' projectpath='video'/>
        <file category='sourceC' name='components/video/display/dc/ssd1963/fsl_dc_fb_ssd1963.c' projectpath='video'/>
        <file category='include' name='components/video/display/dc/ssd1963/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='dcdc_1' Cversion='2.3.0' condition='driver.dcdc_1.condition_id'>
      <description>DCDC Driver</description>
      <files>
        <file category='sourceC' name='devices/MIMXRT1024/drivers/fsl_dcdc.c' projectpath='drivers'/>
        <file category='header' name='devices/MIMXRT1024/drivers/fsl_dcdc.h' projectpath='drivers'/>
        <file category='include' name='devices/MIMXRT1024/drivers/'/>
      </files>
    </component>
