vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1024_DFP.pdsc
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='wm8904' Cversion='2.5.1' condition='driver.wm8904.condition_id'>
      <description>Driver wm8904</description>
      <RTE_Components_h>
#ifndef CODEC_WM8904_ENABLE
#define CODEC_WM8904_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category='header' name='components/codec/wm8904/fsl_wm8904.h' projectpath='codec'/>
        <file category='sourceC' name='components/codec/wm8904/fsl_wm8904.c' projectpath='codec'/>
        <file category='include' name='components/codec/wm8904/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='wm8960' Cversion='2.2.4' condition='driver.wm8960.condition_id'>
      <description>Driver wm8960</description>
      <RTE_Components_h>
#ifndef CODEC_WM8960_ENABLE
#define CODEC_WM8960_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category='header' name='components/codec/wm8960/fsl_wm8960.h' projectpath='codec'/>
        <file category='sourceC' name='components/codec/wm8960/fsl_wm8960.c' projectpath='codec'/>
        <file category='include' name='components/codec/wm8960/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='wm8962' Cversion='2.2.0' condition='driver.wm8962.condition_id'>
      <description>Driver wm8962</description>
      <RTE_Components_h>
#ifndef CODEC_WM8962_ENABLE
#define CODEC_WM8962_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category='header' name='components/codec/wm8962/fsl_wm8962.h' projectpath='codec'/>
        <file category='sourceC' name='components/codec/wm8962/fsl_wm8962.c' projectpath='codec'/>
        <file category='include' name='components/codec/wm8962/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='xbara' Cversion='2.0.6' condition='driver.xbara.condition_id'>
      <description>XBARA Driver</description>
      <files>
        <file category='header' name='devices/MIMXRT1024/drivers/fsl_xbara.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MIMXRT1024/drivers/fsl_xbara.c' projectpath='drivers'/>
        <file category='include' name='devices/MIMXRT1024/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='xbarb' Cversion='2.0.2' condition='driver.xbarb.condition_id'>
      <description>XBARB Driver</description>
      <files>
        <file category='header' name='devices/MIMXRT1024/drivers/fsl_xbarb.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MIMXRT1024/drivers/fsl_xbarb.c' projectpath='drivers'/>
        <file category='include' name='devices/MIMXRT1024/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Utilities' Csub='misc_utilities' Cversion='1.1.1' condition='utilities.misc_utilities.condition_id'>
      <description>
        Utilities which is needed for particular toolchain like the SBRK function required to address limitation between HEAP and STACK in GCC toolchain library.
      </description>
      <files>
        <file condition='allOf.toolchains=armgcc.condition_id' category='sourceC' name='devices/MIMXRT1024/utilities/fsl_syscall_stub.c' projectpath='utilities'/>
        <file condition='allOf.toolchains=armgcc.condition_id' category='sourceC' name='devices/MIMXRT1024/utilities/fsl_sbrk.c' projectpath='utilities'/>
        <file condition='allOf.toolchains=armgcc, mdk, cores=cm7f.condition_id' category='sourceAsm' name='devices/MIMXRT1024/utilities/fsl_memcpy.S' projectpath='utilities'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Utilities' Csub='assert' Cversion='1.0.0' condition='utility.assert.condition_id'>
      <description>Utility assert</description>
      <files>
        <file category='header' name='devices/MIMXRT1024/utilities/debug_console/fsl_assert.h' projectpath='utilities'/>
        <file category='sourceC' name='devices/MIMXRT1024/utilities/debug_console/fsl_assert.c' projectpath='utilities'/>
        <file category='include' name='devices/MIMXRT1024/utilities/debug_console/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Utilities' Csub='assert_lite' Cversion='1.0.0' condition='utility.assert_lite.condition_id'>
      <description>Utility assert_lite</description>
      <files>
        <file category='header' name='devices/MIMXRT1024/utilities/debug_console_lite/fsl_assert.h' projectpath='utilities'/>
        <file category='sourceC' name='devices/MIMXRT1024/utilities/debug_console_lite/fsl_assert.c' projectpath='utilities'/>
        <file category='include' name='devices/MIMXRT1024/utilities/debug_console_lite/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Utilities' Csub='debug_console' Cversion='1.0.1' condition='utility.debug_console.condition_id'>
      <description>Utility debug_console</description>
      <files>
        <file category='header' name='devices/MIMXRT1024/utilities/debug_console/fsl_debug_console.h' projectpath='utilities/debug_console'/>
        <file category='sourceC' name='devices/MIMXRT1024/utilities/debug_console/fsl_debug_console.c' projectpath='utilities/debug_console'/>
        <file category='include' name='devices/MIMXRT1024/utilities/debug_console/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Utilities' Csub='debug_console_lite' Cversion='1.0.0' condition='utility.debug_console_lite.condition_id'>
      <description>Utility debug_console_lite</description>
      <files>
        <file category='header' name='devices/MIMXRT1024/utilities/debug_console_lite/fsl_debug_console.h' projectpath='utilities/debug_console_lite'/>
        <file category='sourceC' name='devices/MIMXRT1024/utilities/debug_console_lite/fsl_debug_console.c' projectpath='utilities/debug_console_lite'/>
        <file category='include' name='devices/MIMXRT1024/utilities/debug_console_lite/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Utilities' Csub='debug console template config' Cversion='1.0.0' condition='utility.debug_console_template_config.condition_id'>
      <description>Utility debug_console Template Config</description>
      <files>
        <file category='header' attr='config' name='devices/MIMXRT1024/utilities/debug_console/config/fsl_debug_console_conf.h' version='1.0.0' projectpath='utilities/debug_console/config'/>
      </files>
    </component>
